Revit 2027 API
OverrideGraphicSettings.CutForegroundPatternId Property
 The ElementId of the cut face foreground fill pattern override. A value of InvalidElementId means no override is set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId CutForegroundPatternId { get; }
Public ReadOnly Property CutForegroundPatternId As ElementId
	Get
public:
property ElementId^ CutForegroundPatternId {
	ElementId^ get ();
}
member CutForegroundPatternId : ElementId with get
Property Value
ElementId
See Also
Reference
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace